# Создайте программу для игры в ""Крестики-нолики"".

def monitor_out(m):          # вывод на монитор
    print(' | 1 | 2 | 3 |')
    print('--------------')
    print('1|', m[0][0], '|', m[0][1], '|', m[0][2], '|')
    print('--------------')
    print('2|', m[1][0], '|', m[1][1], '|', m[1][2], '|')
    print('--------------')
    print('3|', m[2][0], '|', m[2][1], '|', m[2][2], '|')
    print('--------------')
    return


def win_combo(m):            # проверка победы
    if (m[0][0] == 'X' and m[0][1] == 'X' and m[0][2] == 'X') or (m[1][0] == 'X' and m[1][1] == 'X' and m[1][2] == 'X') or (m[2][0] == 'X' and m[2][1] == 'X' and m[2][2] == 'X') or (m[0][0] == 'X' and m[1][0] == 'X' and m[2][0] == 'X') or (m[0][1] == 'X' and m[1][1] == 'X' and m[2][1] == 'X') or (m[0][2] == 'X' and m[1][2] == 'X' and m[2][2] == 'X') or (m[0][0] == 'X' and m[1][1] == 'X' and m[2][2] == 'X') or (m[0][2] == 'X' and m[1][1] == 'X' and m[2][0] == 'X'):
        win = 'Команда X'
        return win
    elif (m[0][0] == 'O' and m[0][1] == 'O' and m[0][2] == 'O') or (m[1][0] == 'O' and m[1][1] == 'O' and m[1][2] == 'O') or (m[2][0] == 'O' and m[2][1] == 'O' and m[2][2] == 'O') or (m[0][0] == 'O' and m[1][0] == 'O' and m[2][0] == 'O') or (m[0][1] == 'O' and m[1][1] == 'O' and m[2][1] == 'O') or (m[0][2] == 'O' and m[1][2] == 'O' and m[2][2] == 'O') or (m[0][0] == 'O' and m[1][1] == 'O' and m[2][2] == 'O') or (m[0][2] == 'O' and m[1][1] == 'O' and m[2][0] == 'O'):
        win = 'Команда O'
        return win
    else:
        win = 'играем дальше'
        return win


m = list([[' ', ' ', ' '], [' ', ' ', ' '], [' ', ' ', ' ']])
monitor_out(m)
x = input(
    'Введите английские Х или О (кто ходит первым, Команда Х или Команда О): ').upper()
if x == 'X' or x == 'O':
    print('Игра XO начинается!!!')
else:
    exit('Не хотите играть? Печалька, но как хотите...')
win = 'играем дальше'   # статус игры
in_put = 1              # флаг свободного поля
n = 1                   # счетчик ходов
n_max = 10              # максимальный ход без победы
while win == 'играем дальше':
    if n == n_max:
        exit('Ничья!!! Победила Дружба!!!')
    while in_put == 1:
        print(n, 'Ход. Ходит Команда', x,
              '-> Введите координаты через пробел: ', end='')
        me = (input()).split()
        if m[int(me[0]) - 1][int(me[1]) - 1] == ' ':
            m[int(me[0]) - 1][int(me[1]) - 1] = x
            in_put = 0
        else:
            print('Внимание!!! Поле занято, повторите ход')
    in_put = 1
    monitor_out(m)
    win = win_combo(m)
    if x == 'X':
        x = 'O'
    else:
        x = 'X'
    n = n + 1
print('Игра окончена, ПОБЕДИЛА', win, '!!! Всем спасибо.')
