# Задача 5
# Напишите программу, которая принимает на вход координаты двух точек
# и находит расстояние между ними в 2D пространстве.

# A (3,6); B (2,1) -> 5,09
# A (7,-5); B (1,-1) -> 7,21

print('Введите координаты точки А: ')
x1 = int(input('Х = '))
y1 = int(input('Y = '))
print('Введите координаты точки B: ')
x2 = int(input('Х = '))
y2 = int(input('Y = '))
d = (((x2-x1)**2+(y2-y1)**2))**0.5
d = d*100//1/100
print('A (', x1, ', ', y1, ');', end=' ')
print('B (', x2, ', ', y2, ')', end=' ')
print('-->  ', d)
