def get_ide():
    id = ['№', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10']
    return id


def get_name():
    name = ['Ф.И.О.', 'Титов Иван Александрович', 'Калинина Вера Максимовна','Захаров Вячеслав Ильич', 'Афанасьев Даниил Кириллович', 'Румянцев Артемий Артёмович', 'Белоусов Ярослав Семёнович', 'Игнатов Артём Павлович', 'Новиков Глеб Дамирович', 'Анисимова Лейла Артёмовна', 'Михайлова София Романовна']
    return name


def get_birthday():
    birthday = ['Год рождения', '10.05.1985', '23.02.1965','11.10.1990', '07.08.1998', '19.03.2004', '29.12.1987', '13.02.2012', '15.06.1998', '10.10.1910', '30.07.1968']
    return birthday


def get_department():
    department = ['Отдел', 'Расчетный','Кухня', 'Аналитика', 'Металлоприем', 'ЧПУ', 'ЧПУ', 'Офис', 'Офис', 'Досуг', 'Управление']
    return department


def get_speciality():
    speciality = ['Должность', 'Начальник','Повар', 'Оператор', 'Разнорабочий', 'Инжинер', 'Главный инжинер', 'Администратор', 'Курьер', 'Аниматор', 'Директор']
    return speciality


def get_telephone():
    telephone = ['Телефон', '89274536776', '89336548989', '89274534455', '89034563488', '89442315665', '89998789192', '89016713243', '13029997433', '16893964040', '14025657490']
    return telephone


def get_receipt():
    receipt = ['Дата приема', '10.05.2009', '23.02.2018','11.10.2021', '07.08.2009', '19.03.2017', '29.12.2011', '13.02.2012', '15.06.2015', '10.10.2019', '30.07.2020']
    return receipt    


def gener_collection():
    return get_ide(), get_name(), get_birthday(), get_department(), get_speciality(), get_telephone(), get_receipt()